# 3. Найти и вывести на экран квадраты и кубы чисел от 2 до 5.

# Задача 3: Нахождение квадратов и кубов чисел от 2 до 5.

print("\nЗадача 3: Квадраты и кубы чисел от 2 до 5:")
for number in range(2, 6):
    square = number ** 2  # Квадрат числа
    cube = number ** 3  # Куб числа
    print(f"{number}: квадрат = {square}, куб = {cube}")

