#  Решить следующие задачи на оценку: 
# 1.  Ввести 4 числа. Найти и вывести на экран сумму и количество отрицательных чисел
# 2.  Ввести 4 числа. Найти и вывести на экран количество четных чисел. 
# 3.  Найти и вывести на экран квадраты и кубы чисел от 2 до 5. 
# 4.  Найти и вывести на экран S=1!+2!+3!+4!+…+n! (n>1). 
# 5.  Ввести N чисел. Найти и вывести их среднее арифметическое. 
# 6.  Ввести N чисел. Посчитать и вывести количество чисел равных нулю. 
# 7. Даны два целых числа А и В (А < В). Вывести в порядке убывания все целые числа, 
# расположенные между А и В (включая сами числа А и В), а также количество этих 
# чисел (использовать оператор цикла). 
# 8. Даны два целых числа А и В (А < В). Найти сумму всех целых чисел от А до В 
# включительно (использовать оператор цикла). 
# 9. 
# Посчитать и вывести количество элементов арифметической прогрессии, 
# удовлетворяющих условию 10<ai<30. 
# 10. Вывести первые N (N≥3) чисел Фибоначчи и посчитать количество четных чисел. 
# 11. Дана арифметическая прогрессия а1=1, а2=4, а3=7, а4=10, а5=13, … Составить 
# программу, которая каждый элемент прогрессии разделит на 2 и результат округлит 
# до ближайшего целого. 